JW-Control/platform-jwplc/JWPLC/JWPLC-2.0.0/boards.txt
jwplcbasiccore.build.f_cpu=240000000L
jwplcbasiccore.build.flash_size=4MB
jwplcbasiccore.build.flash_freq=40m
jwplcbasiccore.build.flash_mode=dio
jwplcbasiccore.build.boot=qio
jwplcbasiccore.build.partitions=default
jwplcbasiccore.build.defines=-DJWPLC_BASIC -DHAVE_TCA6424A -DJWPLC_HAS_RTC=1 -DJWPLC_HAS_FRAM=0 -DJWPLC_HAS_SD=0 -DJWPLC_HAS_ETHERNET=0 -DJWPLC_FRAM_SIZE_BYTES=0
jwplcbasiccore.build.loop_core=
jwplcbasiccore.build.event_core=

### Menú de particiones
jwplcbasiccore.menu.PartitionScheme.default=Default 4MB with spiffs (1.2MB APP/1.5MB SPIFFS)
jwplcbasiccore.menu.PartitionScheme.default.build.partitions=default
jwplcbasiccore.menu.PartitionScheme.defaultffat=Default 4MB with ffat (1.2MB APP/1.5MB FATFS)
jwplcbasiccore.menu.PartitionScheme.defaultffat.build.partitions=default_ffat
jwplcbasiccore.menu.PartitionScheme.minimal=Minimal (1.3MB APP/700KB SPIFFS)
jwplcbasiccore.menu.PartitionScheme.minimal.build.partitions=minimal
jwplcbasiccore.menu.PartitionScheme.no_fs=No FS 4MB (2MB APP x2)
jwplcbasiccore.menu.PartitionScheme.no_fs.build.partitions=no_fs
jwplcbasiccore.menu.PartitionScheme.no_fs.upload.maximum_size=2031616
jwplcbasiccore.menu.PartitionScheme.no_ota=No OTA (2MB APP/2MB SPIFFS)
jwplcbasiccore.menu.PartitionScheme.no_ota.build.partitions=no_ota
jwplcbasiccore.menu.PartitionScheme.no_ota.upload.maximum_size=2097152
jwplcbasiccore.menu.PartitionScheme.huge_app=Huge APP (3MB No OTA/1MB SPIFFS)
jwplcbasiccore.menu.PartitionScheme.huge_app.build.partitions=huge_app
jwplcbasiccore.menu.PartitionScheme.huge_app.upload.maximum_size=3145728
jwplcbasiccore.menu.PartitionScheme.min_spiffs=Minimal SPIFFS (1.9MB APP with OTA/128KB SPIFFS)
jwplcbasiccore.menu.PartitionScheme.min_spiffs.build.partitions=min_spiffs
jwplcbasiccore.menu.PartitionScheme.min_spiffs.upload.maximum_size=1966080
jwplcbasiccore.menu.PartitionScheme.custom=Custom
jwplcbasiccore.menu.PartitionScheme.custom.build.partitions=
jwplcbasiccore.menu.PartitionScheme.custom.upload.maximum_size=16777216

### Menú de frecuencia CPU
jwplcbasiccore.menu.CPUFreq.240=240MHz (WiFi/BT)
jwplcbasiccore.menu.CPUFreq.240.build.f_cpu=240000000L
jwplcbasiccore.menu.CPUFreq.160=160MHz (WiFi/BT)
jwplcbasiccore.menu.CPUFreq.160.build.f_cpu=160000000L
jwplcbasiccore.menu.CPUFreq.80=80MHz (WiFi/BT)
jwplcbasiccore.menu.CPUFreq.80.build.f_cpu=80000000L

### Menú de frecuencia Flash
jwplcbasiccore.menu.FlashFreq.80=80MHz
jwplcbasiccore.menu.FlashFreq.80.build.flash_freq=80m
jwplcbasiccore.menu.FlashFreq.40=40MHz
jwplcbasiccore.menu.FlashFreq.40.build.flash_freq=40m

### Opcional: afinidad de núcleos
jwplcbasiccore.menu.LoopCore.1=Core 1
jwplcbasiccore.menu.LoopCore.1.build.loop_core=-DARDUINO_RUNNING_CORE=1
jwplcbasiccore.menu.LoopCore.0=Core 0
jwplcbasiccore.menu.LoopCore.0.build.loop_core=-DARDUINO_RUNNING_CORE=0

jwplcbasiccore.menu.EventsCore.1=Core 1
jwplcbasiccore.menu.EventsCore.1.build.event_core=-DARDUINO_EVENT_RUNNING_CORE=1
jwplcbasiccore.menu.EventsCore.0=Core 0
jwplcbasiccore.menu.EventsCore.0.build.event_core=-DARDUINO_EVENT_RUNNING_CORE=0